{
   "flags":[
      {
         "name":"admin_host",
         "description":"Host name to which the admin server should bind. (default: localhost)",
         "type": "STRING"
      },
      {
         "name":"admin_port",
         "description":"Port to which the admin server should bind. (default: 8000)",
         "type": "STRING"
      },
      {
         "name":"allow_skipped_files",
         "description":"Make files specified in the app.yaml \"skip_files\" or \"static\" handles readable by the application. (default: true)",
         "type": "BOOLEAN"
      },
      {
         "name":"api_host",
         "description":"Host name to which the server for API calls should bind. (default: localhost)",
         "type": "STRING"
      },
      {
         "name":"api_port",
         "description":"Port to which the server for API calls should bind. (default: random available port)",
         "type": "STRING"
      },
      {
         "name":"appidentity_email_address",
         "description":"Email address associated with a service account that has a downloadable key. May be None for no local application identity.",
         "type": "STRING"
      },
      {
         "name":"appidentity_private_key_path",
         "description":"Path to private key file associated with service account (.pem format). Must be set if appidentity_email_address is set.",
         "type": "STRING"
      },
      {
         "name":"auth_domain",
         "description":"Name of the authorization domain to use. (default: gmail.com)",
         "type": "STRING"
      },
      {
         "name":"application",
         "description":"Set the application, overriding the application value from the app.yaml file.",
         "type": "STRING"
      },
      {
         "name":"automatic_restart",
         "description":"Restart instances automatically when files relevant to their module are changed. (default: true)",
         "type": "BOOLEAN"
      },
      {
         "name":"blobstore_path",
         "description":"Path to directory used to store blob contents. (default: a subdirectory of --storage_path)",
         "type": "STRING"
      },
      {
         "name":"clear_datastore",
         "description":"Clear the datastore on startup. (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"clear_prospective_search",
         "description":"clear the prospective search subscription index. (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"clear_search_indexes",
         "description":"Clear the search indexes. (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"datastore_consistency_policy",
         "description":"The policy to apply when deciding whether a datastore write should appear in global queries. (default: time)",
         "type": "STRING"
      },
      {
         "name":"datastore_path",
         "description":"Path to a file used to store datastore contents. (default: a file in --storage_path)",
         "type": "STRING"
      },
      {
         "name":"default_gcs_bucket_name",
         "description":"Default Google Cloud Storage bucket name.",
         "type": "STRING"
      },
      {
         "name":"dev_appserver_log_level",
         "description":"The log level below which logging messages generated by the development server will not be displayed on the console (this flag is more useful for diagnosing problems in dev_appserver.py rather than in application code). (default: info)",
         "type": "STRING"
      },
      {
         "name":"enable_sendmail",
         "description":"Use the \"sendmail\" tool to transmit e-mail sent using the Mail API (ignored if --smtp_host is set). (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"enable_task_running",
         "description":"Run \"push\" tasks created using the taskqueue API automatically. (default: true)",
         "type": "BOOLEAN"
      },
      {
         "name":"host",
         "description":"Host name to which application modules should bind. (default: localhost)",
         "type": "STRING"
      },
      {
         "name":"jvm_flag",
         "description":"Additional arguments to pass to the java command when launching an instance of the app. May be specified more than once. Example: --jvm_flag=-Xmx1024m --jvm_flag=-Xms256m",
         "type": "STRING"
      },
      {
         "name":"log_level",
         "description":"The log level below which logging messages generated by application code will not be displayed on the console. (default: info)",
         "type": "STRING"
      },
      {
         "name":"logs_path",
         "description":"Path to a file used to store request logs. (default: a file in --storage_path if not set)",
         "type": "STRING"
      },
      {
         "name":"max_module_instances",
         "description":"The maximum number of runtime instances that can be started for a particular module - the value can be an integer, in which case all modules are limited to that number of instances, or a comma-separated list of module:max_instances, e.g. default:5,backend:3.",
         "type": "STRING"
      },
      {
         "name":"mysql_host",
         "description":"Host name of a running MySQL server used for simulated Google Cloud SQL storage. (default: localhost)",
         "type": "STRING"
      },
      {
         "name":"mysql_password",
         "description":"Password to use when connecting to the MySQL server specified in --mysql_host and --mysql_port or --mysql_socket.",
         "type": "STRING"
      },
      {
         "name":"mysql_port",
         "description":"Port number of a running MySQL server used for simulated Google Cloud SQL storage. (default: 3306)",
         "type": "STRING"
      },
      {
         "name":"mysql_socket",
         "description":"Path to a Unix socket file to use when connecting to a running MySQL server used for simulated Google Cloud SQL storage.",
         "type": "STRING"
      },
      {
         "name":"mysql_user",
         "description":"Username to use when connecting to the MySQL server specified in --mysql_host and --mysql_port or --mysql_socket",
         "type": "STRING"
      },
      {
         "name":"port",
         "description":"Lowest port to which application modules should bind. (default: 8080)",
         "type": "STRING"
      },
      {
         "name":"prospective_search_path",
         "description":"Path to a file used to store the prospective search subscription index. (default: a file in --storage_path if not set)",
         "type": "STRING"
      },
      {
         "name":"require_indexes",
         "description":"Generate an error on datastore queries that requires a composite index not found in index.yaml. (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"search_indexes_path",
         "description":"Path to a file used to store search indexes. (default: a file in --storage_path if not set)",
         "type": "STRING"
      },
      {
         "name":"show_mail_body",
         "description":"Logs the contents of e-mails sent using the Mail API. (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"skip_sdk_update_check",
         "description":"Skip checking for SDK updates (if not set, use .appcfg_nag to decide). (default: false)",
         "type": "BOOLEAN"
      },
      {
         "name":"smtp_allow_tls",
         "description":"Allow TLS to be used when the SMTP server announces TLS support (ignored if --smtp_host is not set). (default: true)",
         "type": "BOOLEAN"
      },
      {
         "name":"smtp_host",
         "description":"Host name of an SMTP server to use to transmit e-mail sent using the Mail API.",
         "type": "STRING"
      },
      {
         "name":"smtp_password",
         "description":"Password to use when connecting to the SMTP server specified with --smtp_host.",
         "type": "STRING"
      },
      {
         "name":"smtp_port",
         "description":"Port number of an SMTP server to use to transmit e-mail sent using the Mail API (ignored if --smtp_host is not set). (default: 25)",
         "type": "STRING"
      },
      {
         "name":"smtp_user",
         "description":"Username to use when connecting to the SMTP server specified with --smtp_host.",
         "type": "STRING"
      },
      {
         "name":"storage_path",
         "description":"Path to the data (datastore, blobstore, etc.) associated with the application.",
         "type": "STRING"
      },
      {
         "name":"threadsafe_override",
         "description":"Override the application's threadsafe configuration - the value can be a boolean, in which case all modules threadsafe setting will be overridden or a comma-separated list of module:threadsafe_override e.g. \"default:False,backend:True\"",
         "type": "STRING"
      },
      {
         "name":"use_mtime_file_watcher",
         "description":"Use mtime polling for detecting source code changes - useful if modifying code from a remote machine using a distributed file system. (default: false)",
         "type": "BOOLEAN"
      }
   ]
}
